import calculate from './calculate'

/**
 * Функция для замыкания аргументов внутри функции без аргументов
 * @param f функция для вызова
 * @param args аргументы, передаваемые в функцию f
 * @returns функция без аргументов
 */
 function callf(f: (...args: any[])=>void, ...args:any[]) {
  return ()=>{ f(...args) }
}

/******************************************************************************
 * ZCrone addSequence
 ******************************************************************************/
describe('ZCrone addSequence', ()=>{
  const testset = [
    '1000+2*777-25/5*12',
    '255*2-14/7*23/2+123',
    '255+2-14-7*23-2+123',
    '4567,35*34.36+326/233,37-234.12*56.15',
    '4567,35*34.36/12*134/123/65*23*4+326/233,37-234.12*56.15-123.4-32-54+12+654+123',
    '4567,35 * 34.36/ 12*134/123/65* 23*4+326 / 233,37-234.12 *56.15-123.4-32 -54+12+654+123'


  ]  
  for(let i=0;i<testset.length;i++) {
    it(`test string='${testset[i]}', `, callf( (s)=>{
      const r = calculate(s)
      expect(r).toBeCloseTo(eval(s.replace(/,/g,'.')))
    }, testset[i])
    )
  }

})